app/User.php

select * from `common`.`managers` where `user_id` = 1648 limit 1
---
      }
      if(!isset($item)){
        if(empty($domain) ){
          $item = Manager::where('user_id', $this->id)->first();