app/User.php

    public function details($domain = ""){

      //Manager | Teacher | Studentのいずれかで認証し情報を取り出す
      $image = $this->image;
      $s3_url = '';
      if(isset($image)){
        $s3_url = $image->s3_url;
      }
      //id=1はroot
      if($this->id==1 || session('login_role') == 'manager' || $domain=="managers"){
        //事務でない権限で事務の情報を取得できない（例えば、事務からの通達など）
        if(empty($domain) || $domain=="managers"){
          $item = Manager::where('user_id', $this->id)->first();
          if(isset($item)){
            $item['manager_id'] = $item['id'];
            if($this->id==1 || (session('login_role') == 'manager' && $item->is_admin()==true)){
              $item['role'] = 'manager';
            }
            else {
              $item['role'] = 'staff';
            }
          }
        }
      }
      if(!isset($item)){
        if(empty($domain) || $domain=="teachers"){
        $item = Teacher::where('user_id', $this->id)->first();
---
select * from `common`.`managers` where `user_id` = 754 limit 1
select * from `common`.`teachers` where `user_id` = 754 limit 1

      }
      if(!isset($item)){
        if(empty($domain) || $domain=="parents"){
          $item = StudentParent::where('user_id', $this->id)->first();
---
select * from `common`.`student_parents` where `user_id` = 754 limit 1

      }
      if(!isset($item)){
        if(empty($domain) || $domain=="students"){
          $item = Student::where('user_id', $this->id)->first();
---
select * from `common`.`students` where `user_id` = 754 limit 1

      }
      if(!isset($item)){
        if(empty($domain) ){
          $item = Manager::where('user_id', $this->id)->first();
---
select * from `common`.`managers` where `user_id` = 754 limit 1

    public function get_comments($form, $only_memo = false){
      $u = $this->details();
      $form['_sort'] ='created_at';
      $comment_types = [];
      $is_desc = false;
      $sort = 'desc';
      if(isset($form['is_asc']) && $form['is_asc']==1){
        $sort = 'asc';
      }
      $is_star = false;
      if(isset($form['is_star']) && $form['is_star']==1){
        $is_star = true;
      }
      $form_date = "";
      $to_date = "";
      if(isset($form['search_from_date'])){
        $from_date = $form['search_from_date'];
      }
      if(isset($form['search_to_date'])){
        $to_date = $form['search_to_date'];
      }
      if(isset($form['search_comment_type'])){
        $comment_types = $form['search_comment_type'];
      }
      $comments = Comment::findTargetUser($this->id);
---
select * from `lms`.`comments` where `target_user_id` = 1 and `type` in ('promotion', 'examination', 'study', 'other', 'trial', 'entry') order by `created_at` desc