app/Http/Controllers/ImportController.php

update `common`.`users` set `password` = 'y$eiyED4vcywZMLaVx2YC0EeNASs8G80.zR.O55ndIkzJ28PAYp5DBS', `updated_at` = '2021-02-22 18:39:36' where `id` > 1
update `common`.`users` set `password` = 'y$oNVZLr000PYcnxkYEM2ulehun1RDRob4hBe0L5UPSQUocqcIg4tVC', `updated_at` = '2021-02-22 18:39:37' where `id` = 1
---
    public function index(Request $request, $object)
    {
      $this->token = $request->header('api-token');
      if($object==='concealment'){
        $res = $this->concealment();
        return $res;
      }
      if($object==='set_password'){
        $password = Hash::make('sakusaku');
        $users = User::where('id','>',1)->update(['password'=>$password]);
        $password = Hash::make('password');
        $users = User::where('id',1)->update(['password'=>$password]);