app/Http/Controllers/StudentParentController.php

  public function search(Request $request)
  {
    $items = $this->model()->with('user.image');
    $user = $this->login_details($request);
    if($this->domain==="students" && $this->is_parent($user->role)){
      //自分の子供のみ閲覧可能
      $items = $items->findChild($user->id);
---
select * from `common`.`users` where `common`.`users`.`id` in (744, 887, 889, 893, 895, 897, 911, 935, 942, 950, 952, 972, 980, 998, 1000, 1003, 1020, 1026, 1058, 1064, 1072, 1074, 1082, 1098, 1102, 1112, 1116, 1118, 1147, 1151, 1155, 1163, 1169, 1188, 1191, 1200, 1202, 1206, 1222, 1226, 1240, 1251, 1273, 1275, 1329, 1341, 1343, 1352, 1359, 1363, 1369, 1377, 1379, 1387, 1398, 1400, 1406, 1416, 1419, 1423, 1425, 1428, 1431, 1435, 1439, 1448, 1456, 1460, 1466, 1476, 1478, 1482, 1484, 1489, 1492, 1494, 1508, 1510, 1519, 1521, 1528, 1530, 1532, 1541, 1543, 1545, 1548, 1550, 1552, 1556, 1558, 1560, 1571, 1573, 1577, 1579, 1581, 1583, 1585, 1589, 1591, 1593, 1597, 1601, 1603, 1605, 1607, 1611, 1613, 1615, 1617, 1619, 1621, 1623, 1625, 1627, 1629, 1632, 1634, 1636, 1638, 1640, 1642, 1644, 1646, 1652, 1660, 1662, 1668, 1672, 1674, 1678, 1684, 1686, 1696, 1698, 1701, 1714, 1716, 1720, 1729, 1732, 1752, 1759, 1763, 1767, 1771, 1775, 1778, 1782, 1790, 1794, 1796, 1799, 1822, 1828, 1835, 1837, 1843, 1845, 1856, 1864, 1866, 1872, 1886, 1888, 1912, 1923, 1939, 1945, 1947, 1949, 1956, 1958, 1960, 1963, 1965, 1968, 1974, 1976, 1978, 1986, 1988, 2002, 2004, 2006, 2012, 2021, 2025, 2029, 2039, 2041, 2049, 2056, 2059, 2063, 2066, 2088, 2092, 2096, 2113, 2115, 2131, 2179)
select * from `lms`.`images` where `lms`.`images`.`id` in (2, 4)