app/Http/Controllers/TrialController.php

select * from `lms`.`trials` where `id` = '334' limit 1
---
   public function ask_hope_to_join(Request $request, $id){
     $trial = Trial::where('id', $id)->first();