app/Http/Controllers/UserController.php

select * from `common`.`general_attributes` where `attribute_key` != 'keys' order by `attribute_key` asc, `sort_no` asc
select * from `common`.`places` order by `sort_no` asc
---
  protected function attributes()
  {
    $user = $this->login_details(new Request());

    $attributes = [];
    $_attributes = GeneralAttribute::where('attribute_key', '!=', 'keys')
    ->orderBy('attribute_key', 'asc')
    ->orderBy('sort_no', 'asc')->get();
    foreach($_attributes as $_attribute){
      //TODO いつかGeneralAttributeですべて管理しきるほがよいかもしれない（is_visible : 画面で使うもの / is_editable : 更新してもよいもの）
      if($_attribute->attribute_value=='dummy' && (!isset($user) || $this->is_manager($user->role)!=true)) continue;

      if(!isset($attributes[$_attribute->attribute_key])){
        $attributes[$_attribute->attribute_key] = [];
      }
      $attributes[$_attribute->attribute_key][$_attribute->attribute_value] = $_attribute->attribute_name;
    }
    $places = Place::enable()->has('floors')->orderBy('sort_no', 'asc')->get();