app/Models/GeneralAttribute.php

select * from `common`.`general_attributes` where `attribute_key` = 'english_teacher' and `attribute_value` = '' limit 1
---
  static public function get_item($key, $value){
    $item = null;

    $d = config('attributes');
    if(isset($d[$key]) && isset($d[$key][$value.""])){
      $item = $d[$key][$value.""];
      $g = new GeneralAttribute;
      foreach($item as $field => $val){
        $g[$field] = $item[$field];
      }
      $item = $g;
    }
    if($item == null){
      \Log::info("------------------");
      $item = GeneralAttribute::where('attribute_key', $key)
        ->where('attribute_value', $value)->first();