app/Models/StudentParent.php

  public function relation(){
    $items = StudentRelation::where('student_parent_id', $this->id)->get();
---
select * from `common`.`student_relations` where `student_parent_id` = 154