app/Models/Trial.php

select * from `lms`.`user_calendars` where       user_calendars.id in (select calendar_id from user_calendar_members where user_id=2273 and status != 'invalid')
---
      }
    }
    if(isset($form['calendar_id']) && $form['calendar_id']>0){
      $calendar = UserCalendar::where('id', $form['calendar_id'])->first();