app/Models/UserCalendar.php

  public function is_access($user_id){
    $parent = StudentParent::where('user_id', $user_id)->first();
---
select * from `common`.`student_parents` where `user_id` = 754 limit 1

  public function teacher_mail($title, $param, $type, $template){
    $param['send_to'] = 'teacher';
    $param['item'] = UserCalendar::where('id', $this->id)->first()->details(1);
---
select * from `common`.`users` where `common`.`users`.`id` = 1648 limit 1