app/Models/UserTag.php

  public function details(){
    $key = $this->tag_key;
    if(!isset($key)) return null;
    if($key==="kids_lesson_course_type") $key = "course_type";
    if($key==="english_talk_course_type") $key = "course_type";
    if($key==="lesson_place"){
      $place = Place::where('id', $this->tag_value)->first();
---
select * from `common`.`places` where `id` = '5' limit 1