app/Models/UserCalendar.php

select * from `common`.`users` where `common`.`users`.`id` = 754 limit 1
---
  static protected function add($form){

    $ret = [];
    $trial_id = 0;
    $user_calendar_setting_id = 0;
    if(isset($form['user_calendar_setting_id'])){
      $user_calendar_setting_id = $form['user_calendar_setting_id'];
    }

    if(isset($form['trial_id'])) $trial_id = $form['trial_id'];
    if(!isset($form['work'])) $form['work'] = '';

    //TODO 重複登録、競合登録の防止が必要
    /*
    $calendar = UserCalendar::searchDate($form['start_time'], $form['end_time'])
      ->findStatuses(['rest', 'cancel', 'lecture_cancel'], true)
      ->where('user_id', $form['target_user_id'])->first();

    if(isset($calendar)){
      return $this->error_response("同じ時間の予定が存在します", "", $form);
    }
    */

    $course_minutes = intval(strtotime($form['end_time']) - strtotime($form['start_time']))/60;

    $status = 'new';
    if(isset($form['work']) && $form['work']==9) $status = 'fix';
    $target_user = null;
    if(isset($form['target_user_id']) && $form['target_user_id']>0) $target_user = User::where('id', $form['target_user_id'])->first();