app/Models/UserCalendar.php

select * from `lms`.`user_calendar_members` where `lms`.`user_calendar_members`.`calendar_id` = 8467 and `lms`.`user_calendar_members`.`calendar_id` is not null
---
  public function dispose(){
    //事務システム側を先に削除
    $this->office_system_api("DELETE");
    UserCalendarMember::where('calendar_id', $this->id)->delete();